01  WS-AREA-1 PIC X(100). 
01  WS-AREA-2 PIC 9(9) VALUE 0. 
* Some COBOL statements 
ADD 1 TO WS-AREA-2. 
IF WS-AREA-2 > 5 THEN
    MOVE 'Error' TO WS-AREA-1
ELSE
    MOVE 'Success' TO WS-AREA-1
END-IF.
DISPLAY WS-AREA-1.